#include <stm32f10x.h>

static u8  fas_us = 0;//us延时倍乘数
static u16 fas_ms = 0;//ms延时倍乘数
/**********************************************************
*功  能：延时初始化
*参  数：无
*返回值：无
**********************************************************/
void Delay_Init()
{
	SysTick->CTRL &= ~(1<<2);			//使用外部时钟
	fas_us = SystemCoreClock/8000000;	//微秒定时器初值
	fas_ms = fas_us*1000;				//毫秒延时定时器初值
}
/**********************************************************
*功  能：微秒级延时
*参  数：nus = 1 即 1us
*返回值：无
**********************************************************/
void Delay_us(u32 nus)
{
	u32 temp = 0;

	SysTick->LOAD = nus*fas_us;			//定时器预装初值
	SysTick->VAL = 0;					//计数器清零
	SysTick->CTRL = 0x01;				//使能定时器
	do
	{
		temp = SysTick->CTRL;			//读状态
	}
	while((temp&0x01)&&!(temp&(1<<16)));//判断状态
	SysTick->CTRL = 0x00;				//关闭定时器
}
/**********************************************************
*功  能：毫秒级别延时
*参  数：num = 1 即 1ms   num <= 1864
*返回值：无
**********************************************************/
void Delay_ms(u16 num)
{
	u32 temp = 0;

	SysTick->LOAD = (u32)num*fas_ms;		//毫秒延时定时器预装初值
	SysTick->VAL = 0;						//计数器清零
	SysTick->CTRL = 0x01;					//使能定时器
	do
	{
		temp = SysTick->CTRL;				//读状态
	}
	while((temp&0x01)&&!(temp&(1<<16)));	//判断状态
	SysTick->CTRL = 0x00;					//关闭定时器
}
